nerDit = {
    "PM": ('螺纹', '三角形螺纹', '矩形螺纹', '梯形螺纹', '锯齿形螺纹', '管螺纹', '粗牙普通螺纹', '细牙普通螺纹', '管联接用细牙普通螺纹',
           '非螺纹密封的55°圆柱管螺纹', '用螺纹密封的55°圆柱管螺纹', '60°圆锥管螺纹', '米制锥螺纹', '圆弧螺纹', '普通平键', '导向平键',
           '薄型平键', '滑键联接', '半圆键', '普通楔键', '钩头楔键', '切向键', '圆头普通平键(A型)', '平头普通平键(B型)', '单圆头普通平键(C型)',
           '普通切向键', '强力切向键', '花键', '花键联接', '矩形花键', '渐开线花键', '钢铆钉', '铜铆钉', '铝铆钉', '半圆头铆钉', '沉头铆钉',
           '半圆头钢铆钉', '沉头钢铆钉', '半沉头铆钉', '开口型扁圆头铆钉', '标牌铆钉', '熔化焊', '气焊', '电弧焊', '手工电弧焊', '埋弧焊',
           '氩弧焊', '二氧化碳气体保护焊', '真空电子束焊', '电渣焊', '对焊', '点焊', '缝焊', '钎焊', '碳钢焊条', '低合金钢焊条', '不锈钢焊条',
           '堆焊焊条', '铸铁焊条', 'E4300', 'E4301', 'E5001', 'E4303', 'E5003', 'E4311', 'E5011', 'E4313', 'E4353', 'E5015', 'E4316',
           'E4315', 'E5016', 'E4320', 'E4323', 'E4324', 'E5024', 'E4327', 'E5027', 'E5028', 'E5015-A1', 'E5500-B1', 'E5503-B1',
           'E5515-B1', 'E5515-B2', 'E5500-B2-V', 'E5515-B2-V', 'E5515-B2-VNb', 'E5515-B2-VW', '有机胶粘剂', '天然胶粘剂', '动物胶',
           '植物胶', '合成胶粘剂', '热塑性树脂型胶粘剂', '热固性树脂型胶粘剂', '橡胶型树脂型胶粘剂', '混合型胶粘剂', '无机胶粘剂', '磷酸盐型',
           '磷酸盐型胶粘剂', '硅酸盐型', '硅酸盐型胶粘剂', '硼酸盐型', '硼酸盐型胶粘剂', '结构型胶粘剂', '溶剂型胶粘剂', '反应型胶粘剂',
           '热塑性胶粘剂', '溶液型胶粘剂', '乳液型胶粘剂', '膏糊型胶粘剂', '粉末型胶粘剂', '环氧树脂胶粘剂', '酚醛树脂胶粘剂', '丙烯酸酯胶粘剂',
           '聚氨酯胶粘剂', '杂环高分子胶粘剂', '不饱和聚酯树脂胶粘剂', '螺栓联接', '双头螺柱联接', '螺钉联接', '紧定螺钉联接', '对顶螺母',
           '弹簧垫圈', '自锁螺母', '开口销与六角开槽螺母', '止动垫圈', '串联铁丝', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ),
    "MA": ('金属', '塑料', '橡胶', '玻璃', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
           '', '', '', '', '', '', ''
    )
}
